the
of
return
given
a
is
and
in
are
that
an
to
you
if
integer
array
number
where
be
can
it
for
each
all
n
1
with
two
from
any
or
there
0
one
at
by
not
such
string
as
integers
order
have
example
length
on
following
-
nums
i
0-indexed
x
same
no
will
has
this
minimum
only
note
2
may
maximum
ith
value
k
after
answer
sum
than
some
which
equal
s
possible
its
then
elements
between
first
true
should
every
also
otherwise
binary
must
positive
more
find
characters
we
-1
left
strings
into
right
so
3
false
values
exactly
represents
list
other
m
2d
index
element
them
contains
times
size
both
empty
j
they
row
most
your
ie
make
int
time
nodes
least
tree
different
representing
choose
sequence
numbers
when
operation
letters
their
exists
words
node
7
multiple
arrays
column
character
b
result
either
valid
does
consisting
unique
indices
do
type
matrix
sorted
move
once
distinct
total
non-empty
adjacent
root
operations
consists
want
grid
another
smallest
cannot
represented
within
key
since
format
109
large
three
digits
contiguous
modulo
initially
position
indicates
less
numsi
name
without
returns
using
write
arr
starting
class
considered
implement
these
new
query
5
lowercase
4
largest
but
defined
path
pair
table
next
last
containing
denotes
contain
start
set
substring
range
before
greater
need
inclusive
target
c
y
numbered
cell
primary
sql
schema
single
take
form
second
up
end
above
subarray
word
even
generated
called
means
object
remove
consecutive
letter
english
remaining
guaranteed
difference
function
initializes
get
respectively
original
edges
allowed
edge
use
conditions
until
pairs
id
test
longest
connected
cells
strictly
rules
reach
change
however
digit
labeled
needed
add
non-negative
distance
perform
point
moves
product
score
input
always
current
points
cases
starts
amount
steps
because
step
four
numsj
assume
nums1
group
case
leading
while
very
subsequence
deleting
design
way
used
space
queries
follows
6
could
appear
formally
day
many
replace
ai
possibly
answers
formed
varchar
top
9
answeri
t
changing
positions
void
bi
1s
graph
down
represent
notice
becomes
takes
was
smaller
whose
xi
edgesi
who
returned
10
resulting
nums2
appears
would
ways
rows
present
exist
game
absolute
zeros
line
ascending
jth
linked
substrings
num
square
ends
head
zero
good
undirected
cost
person
pick
task
numslength
part
0s
let
r
delete
impossible
final
required
swap
lexicographically
performing
increasing
about
output
through
d
like
data
count
yi
direction
corresponding
solution
moving
still
below
common
price
non-decreasing
itself
arri
too
turn
split
8
including
determine
subarrays
z
consider
separated
types
how
initial
information
complete
null
among
algorithm
alice
odd
place
been
previous
representation
process
divisible
along
children
shortest
accepted
val
----------------------
structure
removing
directly
equals
alphabet
chosen
search
permutation
ordered
city
people
become
reverse
spaces
groups
p
decimal
coordinates
palindrome
queriesi
call
made
occurrence
actual
according
none
bottom
optimally
out
1-indexed
kth
satisfies
highest
color
average
height
placed
boolean
32-bit
except
already
divide
removed
go
denoting
infinite
prefix
wants
bob
were
obtained
occurs
derived
simultaneously
define
over
whether
convert
applying
apply
bitwise
obtain
uppercase
goal
seconds
during
long
never
area
occurrences
minutes
outside
select
lengths
lower
code
shown
negative
level
l
o
ab
together
days
date
travel
corner
money
unit
entire
subset
problem
abc
traversal
ones
those
visited
back
10-5
e
plane
board
visit
system
concatenation
pass
player
paths
currently
report
written
added
ans
correct
trees
keys
parent
forward
child
u
directions
connecting
side
being
solve
beginning
players
100
si
leaf
described
tie
sort
special
greatest
playing
said
repeat
rearrange
construct
assigned
instead
customer
fit
bottom-right
duplicates
insert
duplicate
play
turns
flip
parentheses
subsequences
know
calculate
s1
s2
interval
choosing
employee
receive
needs
xor
constraints
check
subtree
user
necessarily
maximize
satisfy
twice
lowest
top-left
just
adding
lists
he
results
based
describes
mat
replacing
frequency
invalid
denote
calls
under
divisor
divided
east
front
squares
leftmost
water
students
addition
inside
standing
again
create
n-1
stones
please
upper
prices
buy
arranged
road
wordsi
see
taken
changed
build
maximized
costs
achieve
consist
power
nums0
rounded
per
located
vertical
text
immediately
filled
found
width
units
meaning
partition
trailing
ansi
full
columns
student
subtract
complexity
signed
nth
1st
built-in
bits
nums1i
names
sentence
several
functions
larger
gets
put
calculated
rectangle
places
------------------------
11
map
exceed
concatenated
assign
vi
ui
weight
adds
employees
clockwise
starti
endi
closest
bit
ids
mentioned
arrlength
passed
longer
available
expression
finish
prime
division
increase
fn
third
similarly
123
extra
box
deleted
rotate
concatenating
wall
diagonal
fewer
occur
col
arr1
share
backward
item
stop
done
numsk
minimized
append
state
coordinate
location
moment
method
floor
bst
rest
colors
destination
differ
horizontal
follow
west
minute
relative
circular
land
increment
pointsi
going
include
certain
minimize
palindromic
reads
properties
items
stone
arrj
round
belongs
merge
replaced
x-axis
users
12
non-overlapping
dictionary
x1
specific
ending
nearest
south
north
building
v
reaches
4-directionally
customers
middle
vertically
repeated
performed
foreign
pattern
store
scores
ri
intervals
-----------------------
around
modified
salary
well
belong
walk
sell
2nd
removes
cities
followed
keep
his
circle
run
robot
asked
company
suppose
directed
jump
vertices
inputs
condition
seat
seats
solutions
counted
sums
depth
match
wins
continuous
additional
having
-------------------
w
examples
stops
friends
sign
room
leave
modify
events
3rd
rotation
matches
inserted
speed
subtrees
2n
x2
numsi1
f
h
26
cover
accepts
permutations
free
timei
boxes
covered
transactions
orders
rotated
pile
zeroes
additionally
rightmost
might
horizontally
higher
neighbors
rule
had
pricei
begin
sequences
rearranging
denoted
decide
limit
queue
car
bidirectional
continue
pay
assuming
base
arr0
constructed
applied
products
singly
event
25
divides
meets
hold
-x
wait
created
word2
word1
white
center
num2
num1
due
now
profit
network
course
nums2i
reversed
leaves
break
colored
house
onto
gridij
open
earliest
15
much
stay
degrees
included
piles
tasks
capacity
win
dollars
requirements
swapping
off
supports
placing
rooted
leetcode
rectangular
file
five
1000
making
rounds
stack
shows
nothing
transform
random
pricesi
she
fits
encoded
year
decided
runs
intersection
program
anywhere
similar
satisfied
triplets
non-zero
sorting
request
lets
plus
subsets
happens
x-y
13
arbitrary
0th
stock
pointer
mark
changes
friend
identical
stream
meet
righti
lefti
indicating
userid
arrive
cycle
vertex
swaps
message
segment
decrease
radius
houses
version
comes
231
remains
image
coins
balanced
mapping
combination
running
concatenate
candies
costi
winner
played
help
high
cycles
associated
arr2
heights
90
top-right
suffix
weights
multiply
slength
o1
flips
overlapping
vice
versa
pieces
alternating
piece
obstacle
finally
querieslength
c1
say
rank
inserts
update
answerlength
read
red
roads
fromi
toi
etc
beautiful
language
collect
implementation
reorder
tasked
arguments
specifically
push
overlap
y1
insertion
evaluate
nums2j
traveling
converted
operator
courses
factor
arithmetic
rearranged
randomly
earlier
themselves
instance
block
axis-aligned
our
figure
321
lexicographical
bank
holds
remain
hour
sides
descending
combinations
what
boundary
street
distribute
taking
support
previously
later
exam
low
logs
nor
selected
doing
ordering
rectangles
bottom-left
broken
pop
olog
explanation
garden
excluding
chessboard
hand
brackets
repeating
parts
indexed
vowel
enter
balls
did
latest
sold
intersect
21
opposite
4th
country
series
absx
received
triangle
queriesj
half
checks
amongst
01
productid
makes
notes
pushes
subsequent
alices
black
blue
source
preorder
future
forms
satisfying
server
divisors
positioned
generate
probability
happy
job
affect
composed
cardinal
constant
worker
waiting
workers
occupied
increases
come
closed
sit
copy
walls
reached
field
underlined
centered
tasksi
hours
work
recall
equivalent
answer1
answer0
101
surrounded
rating
abcd
drop
visits
draw
small
22
maximal
across
neither
descendant
completely
timestamp
anagram
segments
endpoints
a2
trying
reachable
symbol
subtraction
intervalsi
li
world
card
cut
stonesi
andor
period
in-place
ancestor
lie
generates
missing
mean
weighted
deletion
cols
ranges
content
loses
grouped
obstacles
us
ball
transaction
double
judge
ignored
food
addint
non-increasing
absi
merged
indicate
60
independent
enum
strs
rotating
1th
reports
necessary
flipping
individually
g
started
lines
20
inserting
others
finished
vowels
multiplication
thus
y2
frequent
provided
toward
fully
eat
manager
towards
passes
evenly
able
best
q
expressions
earn
give
r1
indirectly
forming
servers
-------------------------
nice
factors
perfect
sentences
jumps
fixed
aa
buildings
blocks
memory
replacement
met
tile
shape
shop
allocate
compute
regardless
coin
differs
ci
roots
reference
island
writing
candy
painted
paint
lead
separate
parents
idi
logsi
labels
plant
print
stores
repeatedly
stored
huge
50
weighti
sets
pushint
record
a1
shift
positioni
station
runtime
various
away
error
procedure
exact
palindromes
allow
contained
locations
rooms
own
pivot
-3
appended
parallel
sale
custom
fall
sequentially
bool
simple
30
numeric
outgoing
department
milliseconds
age
multiplied
her
lose
c2
gain
removal
employeeid
constructor
decreasing
arrival
shorter
chunk
104
descendants
interpreted
hhmm
arrarrlength
splitting
requests
puzzle
automatically
quantity
counterclockwise
video
partitions
kind
access
threshold
perimeter
treat
particular
chose
abcde
nodeval
mod
minimal
methods
marked
whole
sitting
goes
testcases
completed
unless
cars
bag
manner
evaluates
1234
pairsi
team
straight
unknown
unable
prerequisites
strength
numsn
forever
partial
secret
regular
decode
coming
outer
132
rearrangement
linear
container
movement
beyond
tiles
log
variable
customerid
window
restaurant
border
pilesi
doesnt
property
collection
reduce
010
diagonally
encoding
question
sj
increments
returning
matching
entries
rowi
instructions
disconnected
topmost
includes
school
sizes
answerj
label
planted
key-value
16
preceding
expected
varying
40
applies
instances
symbols
dot
hello
infinitely
y-axis
bus
picked
cards
hi
uses
website
transformation
modifying
yj
i1th
flowers
choice
leaving
-231
connects
cause
05
19
facing
simplicity
mapped
unlock
vj
valuesi
uj
yellow
idle
significant
percentage
definition
traverse
attend
freely
components
removals
falls
wordsj
capital
competition
xth
handle
spend
counting
updates
reconstruct
triplet
printed
specified
diagonals
resolve
computed
green
roadsi
passengers
phone
beauty
deletions
alphanumeric
neighboring
slots
else
named
trip
finding
arrives
fill
partitioned
chunks
frequencies
social
reset
equally
collected
shares
0000
languages
2s
accounts
successful
security
pi
command
further
describe
conversion
persons
00
provide
median
14
corresponds
matter
optimal
counts
formula
serialization
calendar
tokens
month
collide
blocked
distances
enough
criteria
attack
nums1length
apple
wi
robots
anagrams
meeting
alphabetical
happen
real
bi-directional
23
messages
office
duration
teams
endpoint
main
alphabetically
overall
gives
lost
train
wordslength
evaluation
bags
planning
representations
numsleft
numsright
aj
colorsi
occurring
i1
i0
frog
jumping
repetition
decoded
standard
title
27
gridrc
maps
xy
arrangement
crosses
appends
deletes
moved
shapes
whereas
allocated
ensure
existing
seven
paid
reaching
denominations
composition
tests
numsnumslength
magic
candidates
causes
root1
root2
complement
questions
teacher
aaa
finds
filling
coli
him
separating
matrixs
assigning
ratio
actions
anything
grow
flower
objects
phrase
integral
b2
decreases
stand
500
disjoint
perm
permi
eats
diff
valuei
display
activity
login
games
shifting
wrapping
remember
journey
travels
stations
fuel
stick
cuts
indicesi
shuffled
constructs
emails
arrk
indexing
pathsi
generator
rolls
die
roll
constraint
arrange
dice
i-th
belonging
parenti
spiral
discount
script
ties
walking
quality
selling
paired
nums3
close
-2
--------------------------
recursively
dates
skip
starttimei
endtimei
distancei
sk
orderdate
immediate
continuously
proven
works
via
root-to-leaf
acyclic
details
getint
recover
ten
passenger
determined
appeared
token
far
picking
sent
traveled
xj
balloon
counter-clockwise
kinds
trips
aforementioned
online
wikipedia
periods
media
starttime
endtime
aba
heighti
passing
component
converting
inclusively
hidden
therefore
internal
mountain
erasing
restrictions
built
account
balance
ranks
ranking
try
successfully
differences
rob
night
xs
repeats
splits
bitwise-xor
vali
numerical
ended
numi
productname
statement
001
nested
jsonparse
hamming
net
17
desired
continues
arrows
merging
usual
processed
float
appending
calling
recursive
executed
calculation
accept
euclidean
public
operators
typed
24-hour
tournament
participating
fourth
p1
intermediate
reformat
--
sub
valsi
shifts
knows
downward
xy-plane
s3
legal
interested
computer
allows
folder
queens
nums2length
respective
consecutively
fraction
begins
opening
inorder
postorder
encode
eating
calculates
dashes
summation
instantaneously
bobs
floors
startpos
triple
clear
acb
vice-versa
sub-arrays
jobs
unfortunately
limited
gcdx
relationship
indexi
causing
kilometers
mathematical
compared
buying
send
produce
speedi
bc
neighbor
route
machine
direct
unlimited
yields
parameter
email
address
formatted
simplified
x-coordinate
y-coordinate
cant
star
track
chooses
dist
unoccupied
engage
supply
parenthesis
r2
undefined
nums1j
working
keeps
connections
critical
connectionsi
connection
numcourses
prerequisitesi
maximizes
respect
costsi
xi1
edgesj
frequently
ik
startvalue
uniquely
contest
28
excel
sheet
tower
view
2-dimensional
members
312
cross
river
warehouse
len
actually
domino
member
equation
coefficient
numerals
expansion
touching
---------------------------
corners
finishing
session
fx
ability
trivially
drawing
force
compressed
run-length
lands
islands
bbb
stashed
robber
booking
movies
movie
painting
lucky
degree
non-space
parentsi
action
stays
bloom
arr1i
arr2j
assignment
bsts
covers
f1
fibonacci
heightsi
chain
nine
principle
six
simply
determines
itemsi
calculator
device
logged
bricks
liter
drives
liters
tank
sticks
refer
better
wish
labelled
formats
domain
leetcodecom
arrleftright
destroyed
quadruplets
face
backwards
environment
unsigned
64-bit
relations
eventually
considering
rangesi
whitespace
reduces
routes
06
averages
obstaclesi
unlocks
locked
asks
attain
pairings
preparing
ingredients
unchanged
cpu
1101
2020
bought
records
n2
str1
str2
reading
eventsi
pointing
2-d
preferred
delivery
placement
behind
libraries
erase
bar
graphi
plots
violating
list2
list1
departments
departmentid
forgot
putint
hash
swapped
asynchronous
numsl
commas
years
banned
balloons
comprises
reminder
collision
big
uncommon
lying
unrooted
buses
catch
dollar
receives
nobody
distributed
blank
api
val2
val1
dimensions
solutionint
likely
subgraph
mini
2359
1-based
32
notation
selecting
distribution
execute
transferred
arrivali
dropped
k-1
solved
contact
police
alerting
wide
regions
captured
rectanglesi
judged
wrong
interface
hasnext
sales
--------------------
lock
driving
truck
bad
ever
tells
indexes
implementing
implemented
simulate
double-ended
normal
deque
filetxt
possibilities
known
pays
enhances
upper-case
height-balanced
imagine
ring
requires
spell
precedence
wordlist
delay
submatrix
promise
reject
cancel
callback
resolved
throws
thrown
promises
decrement
signal
origin
signifies
two-dimensional
iterates
partially
0-9
bookint
clock
p2
abcc
hire
invert
occupy
ace
pyramid
marks
bracket
yyyy-mm-dd
pointers
basket
baskets
fractional
234
entering
plants
show
assert
expectednumslength
expectednums
expectednumsi
assertions
parameters
keeping
checked
aab
plot
slices
row1
col1
row2
col2
ancestors
folders
gridrowcol
34
stacks
distributions
shared
listed
denominator
income
amounti
designed
keyboard
seq
apples
eaten
videos
entirely
non-intersecting
startrow
reuse
factory
salaries
truncate
bef
cab
themself
arriving
profiti
difficulty
a0
initialized
customersi
enters
obtaining
minus
poor
project
lexicographic
submatrices
ignoring
manhattan
execution
exceeds
resultant
fnarri
typei
half-open
drive
updated
candiesi
temperature
guards
section
5th
75
left-to-right
context
widths
local
absnumsi
variables
alphabetic
magical
effect
comprise
compare
searchword
colori
turned
vals
pos
rotations
pref
few
ride
sub-array
fair
zigzag
iterator
xn
cd
structurally
climb
tickets
flipped
offers
collecting
dots
quantities
gcd
matrices
experience
happened
join
rate
1-9
coprime
numsk-1
treated
testing
alternate
disti
loss
furthermore
prerequisite
look
sn
011
ki
maxsum
s0
conflict
picks
terms
partitioning
grid00
gridm
1n
0100
finishes
ij
amounts
nary-tree
n-ary
elapsed
instantly
sliding
queen
meetings
weightsi
held
upcoming
lodashs
resulti
market
instruction
here
managerid
configuration
managers
getting
255
223
natural
reused
segmentation
worddict
x3
bj
numsik
transformed
align
boy
cipher
warm
memoized
cached
factorial
shaped
viewing
contour
skyline
citys
cubes
axes
efficient
crossing
efficiency
old
waits
backspace
penalty
picky
copied
owner
spreads
situated
latter
safely
former
4237214
274
242
45
sessions
f3
matched
training
nums2i1
freq
cloned
fs
ccc
giving
subjected
ratings
listinteger
drops
searchint
carries
cheapest
res
rented
tic-tac-toe
gridrowicoli
movements
costij
housesi
33
yet
summer
separation
classes
parents0
lower-case
labelsi
uninfected
infected
planting
worked
seed
strange
stamps
retrieve
listnode
arr2length
arr1length
treesi
typically
diameter
photo
iiii
xii
400
numeral
usually
ix
roman
ii
900
xx
iv
xxvii
permute
disturbing
12345
235
personid
exceeding
deepest
maxsize
eventdate
someday
playerid
gamesplayed
deviceid
logging
b1
ladder
miles
stationsi
arrived
gas
wooden
queryint
smash
dash
throw
referred
numsb
numsc
numsa
numsd
exchange
0-based
2th
bound
gardens
space-separated
6-sided
rollsi
forwards
reversing
graphs
spanning
rational
groupi
parent0
whenever
sake
dont
bash
aajf
kjf
11106
grouping
a-z
avoid
ranging
roomsi
timej
maxtime
valued
cream
ice
cooldown
datetime
aalength
routine
bill
percent
successive
correctly
ahead
heads
linked-lists
numerically
enddayi
startdayi
fresh
batch
serving
groupsi
serve
signs
gridi
spans
hits
namesi
cba
wordlength
specify
scheduled
--------------------------------------
mixed
connect
gold
situation
80
layers
faster
short
performance
layer
bars
targetsum
divisibility
dag
sumrangeint
numarray
numarrayint
numsindex
updateint
colsum
preserved
js
supposed
removekey
sure
realized
importance
tuples
allotted
flowersi
threads
node2
node1
pascals
rides
3x
pointslength
numsl1
numsr
numsr-1
concept
successor
rope
restaurants
ratingi
maxdistance
filtering
reside
convex
polygon
odd-indexed
even-indexed
single-space
tripsi
departs
departure
everyone
gap
mine
mines
210
120
tweets
tweet
10000
59
monitor
recorded
max
effective
widthi
stacked
matrixij
optimize
0190
cherries
maxi
cellsi
compiler
java
chalkboard
restrictionsi
incoming
transfers
withdrawint
deposit
depositint
popular
withdraw
transfer
studentid
load
xi2
professional
robbing
tonight
stopping
systems
tag
angles
angle
browser
os
region
capture
unsorted
genetic
parser
got
awesome
attempt
saleid
nums0i
displays
slot
turning
wheel
dead
glass
paper
metal
efficiently
majority
weakest
army
individual
kingdom
strengths
supported
peekpop
depending
natively
queues
456
optionally
attending
1001
comma
0001
json
obj
booleanvalue
drawn
lakes
strongest
18
1d
traversing
parsed
rx
fancy
multiplies
idx
selection
overlapped
rings
spelling
keyi
press
aligned
categories
case-insensitive
spellchecker
converts
operates
case-sensitive
capitalization
odd-numbered
cinema
afterwards
fulfilled
dies
someone
birth
older
death
king
family
marking
studentsj
seatsi
rejects
completes
sometimes
yield
const
cancelled
shouldnt
init
shifta
home
bug
app
inputoutput
serialized
attributes
besides
forth
growing
iteration
non-digit
ignore
abbreviated
instructed
intersecting
retrieves
f2
truncates
calculations
asteroid
asteroids
mass
gains
objective
stonevalue
135
s1i
triangular
bac
patterns
evaluating
quotation
endword
beginword
mm
deep
fruits
losing
p0
populate
struct
falling
safe
entered
345
protected
incorrect
password
012
findint
service
positionsi
watering
plantsi
refill
orange
meters
rightward
squared
commands
cook
chef
removeduplicatesnums
kept
things
important
cde
relation
farmland
inverse
i2
3n
slice
anti-clockwise
pizza
105
computers
totally
processes
locks
n-queens
visible
arrangements
02
213
empid
bonus
restricted
holding
brings
page
nesting
url
involving
puts
doctors
rotten
index2
index1
cousins
quote
slash
modifications
disconnect
applications
eee
identified
bb
xxxx
refers
unbroken
eggs
breaks
certainty
egg
startcol
boundaries
elevation
gcdnumsi
limits
repair
limitj
repaired
category
triples
hands
pushing
choices
triangles
punctuation
creating
favorite
history
minimizes
coinsi
transactionsi
incremented
throughout
cyclic
ideal
copies
recently
counter
cache
maintained
reordered
fed
liquid
buckets
pig
feed
live
bucket
pid
attribute
row-wise
resources
projects
vyz
abcdefuvwxyz
wasted
108
stationary
staying
collisions
collides
lca
completing
requestsi
x0
preserving
fifo
everybody
fee
differing
movecost
status
keysi
cartesian
e2
e1
bursting
bounds
burst
temperatures
flood
pixels
chocolates
leftover
install
sections
shot
opponents
soldiers
6th
images
joined
speeds
fleet
one-lane
correspond
brick
targeti
targets
sourcei
shiftsi
primes
peak
cups
quarter
cup
fashion
relationships
wonderful
foods
visiting
designated
speciali
manages
enemy
attacking
super
machines
communicate
cheese
expressed
bomb
decrypt
decrypted
tilesi
carpetlen
durationi
chars
searches
pj
2h
tails
internally
exit
ground
025
volume
worst
tracks
ranked
excluded
encodedi
numrows
subject
university
subjects
fibonacci-like
a-b
staircase
independently
sx
ty
tx
million
sy
ticket
ticketsi
transpose
spreading
comma-separated
an-2
an-1
4567012
0124567
closing
si1
initialize
prefers
preference
incurred
cookies
matij
absent
attendance
eligible
late
award
ascii
isfull
isempty
rear
boxesi
flattened
flatten
tested
90-degree
exclusive
t2
t1
consistent
guessed
guess
guesses
reply
rejected
buyerid
info
orderid
sellerid
2019
powx
timeout
diagram
lies
sub-boxes
sudoku
lined
companys
february
afterward
worth
nums2i2
mid
occupies
uncolored
outcome
faces
performs
stands
singly-linked
identify
110
non
scoresi
eliminate
charged
abcdefghijklmnopqrstuvwxyz
rests
contents
73
bacd
sleftirighti
modifies
sequential
activities
numsnumslength-1
cj
0110
-9
eval
fi
levels
entrance
touches
1100
uniform
convenience
evaluated
innermost
non-leaf
ba
advances
numsk1
numsn-1
tries
ant
plan
1010
proved
permitted
solving
skipped
traversed
definitely
processing
sends
newly
gone
master
finite
2k
piecesi
rooks
bishop
rook
bishops
population
well-formed
daily
meetingsi
library
advance
carry
port
ship
contaminated
installed
installing
solvable
computing
optional
delayed
matrixrowcol
erased
disappear
expiration
extended
2i
farthest
assumed
reformatted
packages
package
180
infinity
timesi
party
linked-list
ansj
sij
subgrid
energy
describing
extract
in-order
distributing
likes
single-threaded
pushed
executing
cutting
ugly
minnums2
args
cancelfn
reduced
tuesday
sunday
monday
answersi
pairwise
aebdc
aeb
half-closed
57
laser
engineer
floating
unused
dominoes
pairing
pressed
flight
i-1th
ycenter
xcenter
upon
floating-point
mode
unary
youre
directory
contrast
strategy
smart
pre-order
targetx
targety
knight
guarded
knights
alength
surface
prepending
newnums
newnumsi
countint
arrow
ch
19216811
addresses
ip
originally
term
files
viewed
defines
interfere
2x
modification
programming
agesi
ages
flat
acceptable
week
monotone
rods
colj
rowj
halves
circumference
success
ranksi
multi-dimensional
duplicated
mouse
powers
server-to-server
sub-tree
advantage
fix
primefactors
flying
interview
bcosti
fly
acosti
haystack
needle
21347112918
18291174312
xk
heroes
minnumsi0
numsik2
maxnumsi0
progression
step-by-step
destvalue
unvisited
parity
grandparent
even-valued
substitution
appearance
substituted
comprising
heaters
warmed
heater
winter
fibn
factorialn
fib
columnnumber
0-height
increased
prism
looking
projections
zx
shadow
3-dimensional
yz
planes
projection
bridge
lefttorighti
regulate
righttolefti
pickoldi
putnewi
righttoleftj
lefttorightj
warehouses
deletetextint
cursorleftint
texteditor
cursorrightint
cursor
min10
editor
simulating
cursorposition
currenttextlength
addtextstring
tiling
tromino
tilings
incur
closes
hence
concert
bookmyshow
hall
ticketing
vary
spectators
scatterint
allocates
maxrow
gatherint
bookmyshowint
book
xvalue
integer-sided
1549
49
notepad
screen
paste
averageamount
visitedon
analyze
fire
grass
spread
safehouse
stayed
14312
1412
ordernumber
customernumber
purple
depicted
rhombus
biggest
wallet
assorted
sessiontime
circularly
traversing-order
f11
39916800
convention
matchings
trainersj
trainers
playersi
trainer
buttons
telephone
2-9
candidate
maxchoosableinteger
pool
desiredtotal
re-use
nextlargest
wrap-around
decompressed
sublists
sublist
truefalse
ts
falses
answerkey
maximizing
trues
answerkeyi
confuse
capability
steals
steal
homes
refuses
robbed
cbad
ramp
rental
movierentingsystem
renting
shopj
resj
rents
searching
entriesi
moviei
moviej
dropint
shopi
shops
rentint
generating
listlistinteger
rent
movierentingsystemint
unrented
sqrt2
pending
movesi
neighborhoods
12233211
neighborhood
hvhvh
hhhvv
providing
10921
self-loops
mat42
mat20
mat31
classesi
beforehand
totali
ratios
brilliant
extrastudents
passi
uam
active
infection
growtimei
seeds
planttimei
growth
growtime
planttime
bloomed
blooming
blooms
targetgridrowcol
printer
solid
targetgrid
setstring
getstring
timestampprev
timemap
time-based
numsw
numsx
numsy
numsz
serializations
treesj
1-d
f0
commonly
therere
annual
expectedi
cnti
xcnti
maxmoves
xcnti-1
subdivide
permuting
greatness
bx2
ay2
by2
ax1
rectilinear
ay1
bx1
ax2
by1
153
soul
eetcode
cool
delightful
sound
exercises
floorpilesi
floorx
widest
fixed-width
extending
turn1
turnn
kilograms
personname
particularly
subtracted
diffi
items2
reti
items1
ret
customstack
pops
incint
customstackint
cardsi
minai
bn
hi1
ladders
furthest
refuel
fueli
startfuel
transferring
mile
refueling
cutsi
subdomains
d1d2
rep
d1d2d3
com
9001
count-paired
discussleetcodecom
subdomain
implicitly
domains
cpdomains
rangefreqquery
rangefreqqueryint
e-mails
mail
e-mail
underscore
expect
tobeval
developers
nottobeval
helps
refereeid
bobsizesj
bobsizes
alicesizesi
alicesizes
reverses
comparison
turbulent
powerful
salaryi
aval
bval
2582
3245
rollmax
simulator
introduced
rollmaxi
went
observations
fortunately
observation
intlength
queriesith
msts
pseudo-critical
mst
212
integerpartnonrepeatingpart
nonrepeatingpart
016666
repeatingpart
123001212
016
integerpartnonrepeatingpartrepeatingpart
1230001
integerpart
portion
conventionally
016666666
beforeitemsi
cstart
grids
northwest
rstart
southeast
pricesj
pipes
wordstxt
unix
worry
one-line
handling
sunny
actor
actorid
director
directorid
actordirector
cooperated
locationsi
locationslength
locationsj
-10
sea
lanes
obstacles2
lane
inventoryi
weirdly
inventory
topping
toppingcosts
toppingcostsi
flavor
toppings
basecostsi
flavors
dessert
basecosts
numspivot
-23
-20
-22
logins
constructb
constructa0
constructa
constructai
amountj
supermarket
getbillint
cashierint
paying
groceries
purchased
subtotal
cashier
productj
productsi
frequented
stadium
visitdate
n1
abdbec
str
bolded
abcabcabc
skipa
listb
headb
intersectval
retain
lista
intersected
heada
skipb
index-0
uniques
revnumsi
rev120
rev123
revx
revnumsj
batchsize
served
batches
donut
donuts
bakes
333
457
1j
stuck
redirect
boards
dropping
redirects
peoples
well-spaced
bcfd
abca
abacba
ceilval
ceiling
ceilnumsi
deliveryid
customerprefdeliverydate
precisely
google
capitals
usa
usage
croaks
frogs
croakoffrogs
printing
croak
size1
size2
medal
athlete
scorei
bronze
athletes
silver
ologn
by-sa
fine
skiplist
kalinin
comparatively
cc
commons
idea
treap
artyom
red-black
comparing
304050607090
skiplists
httpsenwikipediaorgwikiskiplist
eraseint
wikimedia
sweltering
references
div
word0i
divi
graphij
1-stlower
colsumi
0-thupper
column0-indexed
no-adjacent-flowers
flowerbed
abs
tape
splicing
heightij
iswater
iswaterij
numsi-1
whitespaces
hashmap
myhashmap
x-matrix
mistake
millis
sleeps
1121345
nums2leftright
11231415
nums1leftright
sumnums1
sumnums2
1112131415
sumarr
maxlocal
maxlocalij
quadruplet
wrote
seperate
semi-ordered
provides
gender
caretaker
incomplete
newflowers
arrbannedi
bring
bannedi
ocurrences
printfizzbuzz
fizzprintfizz
buzz
printfizz
printbuzz
fizzbuzzprintfizzbuzz
thread
fizz
prints
fizzbuzzint
fizzbuzz
console
buzzprintbuzz
numberprintnumber
printnumber
absc1
pointsrc
sumfirst
sumsecond
requestaccepted
accepterid
acceptdate
requesterid
shortestpathint
edgecost
edgecosti
graphint
addedgeint
rowindex
rowindexth
joins
flag
primaryflag
travelleddistance
minalength
blength
repeatlimit
repeatlimitedstring
answerslength
answersj
incidenta
abbca
appeal
numsdivide
x-values
absnumsl
successors
neededtime
colorful
neededtimei
filter
maxprice
restaurantsi
veganfriendly
filters
veganfriendlyi
floork
self-dividing
128
monkeys
monkey
lot
park
cartype
medium
parkingsystem
parking
parkingsystemint
addcarint
even-odd
non-adjacent
halve
searched
passengersj
busesi
shifted
unrevealed
revealed
minesweeper
clickc
revealing
char
click
clickr
frequencys
tweetcountsgettweetcountsperfrequencyhour
gettweetcountsperfrequencystring
130189
analysis
tweet3
36107209
70129
analyzing
tweetcountsgettweetcountsperfrequencyminute
recordtweet
site
997010000
059
tweetcountsrecordtweetrecordtweetrecordtweetgettweetcountsperfrequencygettweetcountsperfrequencyrecordtweetgettweetcountsperfrequency
86400-second
nullnullnullnull221null4
tweet30tweet360tweet310minutetweet3059minutetweet3060tweet3120hourtweet30210
6060
gettweetcountsperfrequency
60-second
3600-second
103609
recordtweetstring
tweetcountsrecordtweettweet3
tweetname
1010000
0210
tweetcounts
1069
721010000
secondary
ababb
xoring
xor-beauty
cuboid
cuboidsi
cuboids
lengthj
widthj
lengthi
heightj
resets
6345
3951
post
3456
cycled
0158
cherry
thorn
permn
non-alphanumeric
rith
cith
flooded
-1073741825
5247
567
uniformly
carefully
ballsi
arry
arrx
maxheighti
tallest
banklong
account2
balancei
automate
withdrawn
account1
transferint
feedback
negativefeedback
positivefeedback
studentidi
reporti
i2th
handled
computational
busiest
loadi
busy
no-zero
almost
123450
rectanglei
yi2
yi1
posx
posy
determining
obstruct
angle2
vision
countintervals
sright
sleft
nums1i1
nums1i0
nums2ik
nums1ik
minnums2i0
fewest
parentsx
nodei
interpret
al
interpretation
parsers
secondlen
firstlen
pointsj
countj
scoreij
exams
mountainarr
interactive
mountainarraygetk
disqualification
submissions
mountainarray
circumvent
mountainarrgetindex
mountainarraylength
mountainarrayget
differencesi
hiddeni
combinationiteratorstring
combinationiterator
combinationlength
1321
array-form
2143
4321
4123
803
243803
801
243801
243
abcdefg
beefed
puzzlesi
cabbage
baggage
faced
lengthwordj
lengthwordi
streak
maxarr0i
conver
converi
wheels
wrap
codes
deadends
assortment
traveli
garbagei
garbage
responsible
trucks
cardpoints
truth
tell
statementsij
statementsii
statements
matchsticks
matchsticksi
link
matchstick
majoritychecker
majoritycheckerint
wizard
wizards
strengthi
ruler
lifo
last-in-first-out
mystack
stonesj
xxx
7890
456-7890
one-liner
987-123-4567
xxx-xxx-xxxx
xxx-xxxx
base-k
base-2
base-10
k-mirror
contrary
2-mirror
extraneous
205
000
falsy
compact
4x
slant
horizontallyvertically
isnt
rolling
sided
bills
billsi
lemonade
arrm
stronger
-7
snail
iterating
organised
rowscount
snailrowscount
transforms
colscount
wrapped
unmatched
issue
tags
cdatacontent
cdata
cdatacdatacontent
note1
unbalanced
parse
validator
tagcontent
tagname
snippet
forbid
tagnametagcontenttagname
rxxlrxrxl
xr
xl
lx
inc
addallinc
multall
getindexidx
addall
appendval
multallm
bottom-up
groupsize
handi
jane
my
sentence1
sentence2
store2
store1
store3
pressing
keyword
door
freedom
engraved
button
spelled
fallout
anticlockwise
dial
1200
stage
quest
trail
purpose
selects
capitlization
handles
errors
checker
mistakes
yeellow
yollow
yllw
clumsy
factorial10
clumsy10
multiples
genre
boring
description
doubled
shuffling
discovers
forget
discovering
curorder
successorx
throneinheritance
birthstring
parentname
childname
kingname
throneinheritancestring
successoralice
well-defined
grandchildren
successorbob
jack
inheritance
whos
gave
getinheritanceorder
oldest
born
successorjack
successorxs
deathstring
successorking
son
reordering
ys
00010
10010
00001
serverid
responsibility
cancellable
promiseresolve
t50ms
cancellabletasks
t100ms
resolve2
caught
promisecatchconsolelog
settimeoutcancel
yielded
settimeoutresolve
createcounter
cx
garbled
towers
qi
qualities
towersi
cy
p123m
iquerieslength-1
pathi
patterni
leavetimei
shiftx
shiftsi-1
shiftc
forbidden
forbiddeni
bugs
tweetid
recurse
wiki
sub-grids
bottomleft
topleft
isleaf
logical
bottomright
quadtree2
matrixes
quad-tree
quadtree1
topright
sub-grid
terminator
proper
k-sum
sanctioned
pre-existing
government
chart
plotting
stockprices
dayi
stockpricesi
consuming
graphical
atoi
0032
clamped
myatoistring
clamp
ccs
1234554321
12345678987600000
546
abbreviate
1234589876e5
1234567654321
express
presuf
suf
1234567
presufec
pre
math
submitted
rewarded
elementary
grade
eg
352
typewriter
k-booking
mycalendarthree
startdate
unitssold
averageprice
enddate
purchasedate
retrieving
minstack
getmin
fn-1
fn-2
logintime
seventh
midnight
2345
chess
0045
0130
logouttime
0015
logout
nonempty
primitive
outermost
decomposition
pk
polish
operand
revenue
janfebmaraprmayjunjulaugsepoctnovdec
32772
327712
hiring
planet
asteroidsi
librarys
crossword
tleft
tright
leaf-similar
queryindices
queryindicesi
querycharactersi
lengthsi
querycharacters
removequeriesi
removequeries
createhelloworld
134
competitive
s2j
beneath
stacking
pleasing
three-letter
aesthetically
transactionid
visitid
mall
recyclable
lowfats
fat
knowledgei
knowledge
nameisageyearsold
2100
31st
oct
aug
jul
mar
apr
1900
yyyy
nov
dec
30th
dd
jun
feb
jan
sep
brand
xrandom
randomindex
basket2
minbasket1ibasket2j
basket1
fruit
popsmallest
addbackint
smallestinfiniteset
275
avgsi
avgs
k-radius
valsk-1
hashvalue
hashsub
vala
hashs
pk-1
vals0
vals1
valz
012345
recent
typing
checking
peculiar
fills
numbercontainers
changeint
ycentre
xcentre
2d-map
registered
contestid
decimals
username
register
early
oranges
kitchen
employeeuni
uniqueid
distance0
distance2
distance3
distance1
operationsi1
operationsi0
-y
square-free
preparation
dish
satisfactioni
discard
prepared
dishes
satisfaction
like-time
lockedi
handy
matlab
reshape
reshaped
wanted
row-traversing
gridxiyi
minesi
arms
relevant
basestr
implies
s2i
equivalence
acd
transitivity
eed
reflexivity
symmetry
equivalency
sex
tables
temporary
neccesarilly
apex
barren
pyramidal
bottommost
fertile
farmer
cubic
storeroom
cube
numsi2
numsi0
pizzas
bipartite
self-edges
graphv
graphu
row2col2
subrectanglequeries
subrectangle
row1col1
updatesubrectangleint
getvalueint
rowcol
newvalue
battery
batteriesi
recharged
batteries
prevents
unlockint
unlocked
upgrade
upgradeint
upgraded
lockingtreeint
lockint
lockingtree
locking
subfolders
onetwothree
bx
underlying
subfolder
bxy
az
bw
bz
ax
axy
12312
arri-1
uniquely-sized
13254
dest
src2
lastly
src1
constituent
043
listing
labeling
a123bc34d8ef34
freqstack
stack-like
cheating
classroom
supervisor
0156
odd-length
subpath
infrastructure
zk
zi
distancetolastnodex
zi1
z2
distancetolastnodezi1
distancetolastnodezi
z0
z1
irreducible
rightsumi
leftsumi
reward
pricereward
cash
gate
losers
redistribute
prizepositions
prizes
prizepositionsi
prize
pages
web
developer
depthc
vpss
depths
vps
deptha
maxdeptha
depthb
verticalcutsj
cake
horizontalcutsi
horizontalcuts
verticalcuts
brokenletters
properly
malfunctioning
positives
longurl
httpsleetcodecomproblemsdesign-tinyurl
companion
shortening
tiny
tinyurl
httptinyurlcom4e9iak
encodestring
shorturl
decodestring
encodedecode
restriction
numsseqj
forwardbackward
seqk
seq0
seq1
325
min-product
grows
daysi
applesi
rot
expressible
numsindex2
numsindexk
numsindex1
indexk
careful
uploaded
uploads
luprefix
uploadint
upload
luprefixint
comprised
necesssarily
maxwidth
approach
left-justified
pack
justified
greedy
pad
minlength
non-prime
gt
apos
amp
lt
frasl
ampersand
quot
entity
html
entities
unmodified
stretchy
feeling
hiiii
heeellooo
hellooo
helloo
ll
extension
helllllooo
lllll
oo
ooo
maxmove
startcolumn
abbxxxxzyy
36
yy
scrambled
scramble
dfs
depth-first
capacitya
capacities
waters
cans
alicebob
capacityb
hisher
seqlength
seqi
1111
0011
2p
homecol
incurs
colcostsc
homepos
rowcostsr
rowcosts
colcosts
homerow
swim
rain
everywhere
factories
positionj
repairs
roboti
factoryj
20000
monthly
accountid
50000
bitwise-and
couple
switch
couples
bouquets
bloomday
bloomdayi
bouquet
8-directionally
pushfrontint
popping
popmiddle
frontmost
pushmiddleint
popback
popfront
pushbackint
frontmiddleback
truncating
dfe
adc
def
1-dimensional
capable
seating
favoritei
invited
organizing
browserhistoryvisitfacebookcom
clears
forwardint
googlecom
browserhistoryforward1
backint
forwarding
browserhistoryback2
browserhistoryvisityoutubecom
browserhistoryback1
5000
browserhistoryvisitgooglecom
browserhistorystring
leetcodecomgooglecomfacebookcomyoutubecom111linkedincom227
homepagelength
browserhistoryforward2
nullnullnullnullfacebookcomgooglecomfacebookcomnulllinkedincomgooglecomleetcodecom
browserhistoryvisitlinkedincom
linkedincom
browserhistory
visitstring
browserhistoryback7
tab
facebookcom
homepage
browserhistoryleetcodecom
youtubecom
urllength
browserhistoryvisitvisitvisitbackbackforwardvisitforwardbackback
compatibility
achieved
mentors
survey
mentorsj
studentsi
mentor
yes
student-mentor
idkey
osinsert4
aaaaa
bbbbb
valuelength
osinsert3
ddddd
osinsert5
eeeee
ccccc
osinsert2
orderedstream5
orderedstreamint
osinsert1
insertint
concatentating
orderedstream
presence
difficultyi
workerj
legs
puppy
eyes
rectsi
rects
cashbacki
abssum
mxy
opsi
ops
grumpyi
technique
grumpy
bookstore
adjacentpairs
adjacentpairsi
forgotten
violates
strong
remap
remapping
d1
remaps
weekly
danny
sneakily
d2
replaces
326
congratulate
mittal
absarri
n-digits
1337
invalidated
lfucache
lfucacheint
lfu
invalidate
arrlefti
arrrighti
4253
reindexing
minutestodie
consume
pigs
survive
poisonous
minutestotest
insurance
investment
latitude
tiv2015
longitude
lat
lon
holders
policyholders
policy
policyholder
2016
tiv2016
2015
column-wise
soon
profitsi
ipo
pure
capitali
venture
strs00
strs0strs0length
strs11
strs10
strs1strs1length
strs01
sizet
resize
resizing
numst
dynamic
designing
lcm
non-coprime
involved
collided
directionsi
motion
follower
followers
followerid
matrixxy
12c
caaacab
abccdef
licenseplate
insensitive
cbca
segmented
numsstarti
numsendi
minnumsi
y0
exceeded
inner
returnedarrayi
arraymap
wealth
richest
accountsij
myqueue
peek
trusti
trust
rumor
secretly
town
trusts
overwriting
mycalendartwo
passingfees
passingfeesj
fees
numones
numzeros
numnegones
numzeroes
-1s
accommodate
numpassengersi
vehicle
chaining
raises
exponentiation
serves
subtracts
getresult
movecostij
initialboxes
containedboxes
containedboxesi
statusi
rexpr
abdfg
concatenations
rabcd
ra
rw
union
understood
rabbc
acadbcbd
acefg
rabc
abefg
acefh
abefh
singleton
re1
ek
acdfh
rabcdefgh
re2
acdfg
abdfh
grammar
comma-delimited
wisely
arri-k
arr5
arr4
k-increasing
arr3
weather
recorddate
yesterday
pixel
sc
imagesrsc
sr
imageij
debt
securityi
thieves
duty
gang
s1s
cameras
camera
senders
sender
sendersi
messagesi
chat
productkey
bk
bobarrows
scoring
shoots
archery
numarrows
ak
alicearrows
n-sided
triangulation
triangulate
weaker
civilians
even-numbered
twin
n-1-ith
twins
startindex
formatting
reformatting
firstly
slowest
unite
positioni1
carsi
11001
downwards
obviously
crossed
arr1i-arr2j
124789
37
23489
89
querytime
lays
homework
wordsjk
unusuable
ors
stampwidth
stampheight
pickup
pickupi
pickupdelivery
deliveryi
services
unnecessary
targetsi
eeecd
replacements
sources
sourcesi
abbc
testcase
h2o
atomic
chemical
atom
h2o2
h1o2
h2o23
h2o2he3mg4
formulas
allowedswaps
allowedswapsi
directioni
score1
score25
score0
12321
nums-1
peaks
global
inversions
1238
5674
5678
poured
pictured
pouring
excess
champagne
glasses
100th
interesting
maintain
histogram
histograms
boxtypesi
boxtypes
trucksize
numberofunitsperboxi
numberofboxesi
signfuncx
signfuncproduct
intersections
alter
left-out
up-left
equations
xiyi
equationsi
one-letter
xiyihere
smallest-valued
5489355421
5489355214
care
5489355412
5489355142
5489355241
routes0
routesi
ath
list1s
bth
cuisine
highestratedstring
ratingsi
changeratingstring
cuisinesi
newrating
foodratings
foodratingsstring
cuisines
foodsi
highest-rated
2932
329
93
new2
92
new1
relaxation
hero
poisoned
teemo
timeseries
timer
timeseriesi
attacks
poison
ashe
zeroscolj
diffij
zerosrowi
onescolj
onesrowi
washing
dresses
dress
solitaire
unmarked
skilli
skills
chemistry
skill
citybi
cityai
loop
rulevalue
namei
rulekey
teach
languagesi
friendshipsi
friendship
friendships
transitive
guarantee
pi1
p2n
0122n
totaljumbo
burger
jumbo
cheeseslices
totalsmall
tomatoslices
burgers
tomato
uni-value
informer
coden-1
defuse
code0
carpet
homogenous
subsequence1
subsequence2
133
yourself
exception
trimmed312434
trimmedsubarray
trimmed1233344
trimmedsubarraylength
33344the
3434
1233344
boardrc
cmove
rmove
mycalendar
qj
edgelist
edgelisti
disi
enclose
numerator
non-obstacle
walks
4-directional
is2
a3
sentence4
this1
gondola
scenario
boardingcost
runningcost
centennial
gondolas
general
watchedvideosi
watched
friendsi
watchedvideos
mls
ml
soup
queried
invoked
sortracker
addstring
invocation
tracker
attractiveness
querying
scenic
prefi
obeys
1221121221221121122
qwertyuiop
zxcvbnm
asdfghjkl
american
list2j
list1i
evil
346
representative
representatives
mex
-123
103
mhts
minh
harmonious
candiescounti
dailycapi
favoritedayi
candiescount
favoritetypei
paypalishiring
font
pahnaplsiigyir
convertstring
legibility
subjectid
deptid
teacherid
teaches
cyclically
mn
exhausted
rle
nextint
3825
380925
88855
rleiterator
281825
exhaust
exhausts
encodingi
rleiteratorint
-ab
hyphens
ab-
ba-c
afad
hyphen
personal
somewhere
--xxxx
---xxxx
asterisks
0-3
masked
10-13
mask
climbing
ytarget
ghosts
ghost
escape
xtarget
pac-man
ghostsi
blockedi
queuing
absx1
absy1
switching
inform
managerheadid
subordination
news
informtimei
subordinates
manageri
urgent
headid
requiring
pills
pill
requirement
workersj
explode
distancethreshold
vacant
prison
lrucache
lrucacheint
evict
lru
lunch
cafeteria
sandwich
sandwichesi
sandwiches
respecting
arraylast
expensive
fence
enclosed
well-fenced
chargetimesi
runningcostsi
sumrunningcosts
runningcosts
budget
chargetimes
maxchargetimes
charge
chocolate
coincide
bitsetint
bitset
tostring
fixint
compactly
unfixint
gi
cookie
greed
worddictionaryaddwordmad
worddictionarysearchpad
addwordword
addword
worddictionarysearchb
worddictionarysearchad
worddictionaryaddworddad
worddictionaryaddwordaddwordaddwordsearchsearchsearchsearch
baddadmadpadbadadb
worddictionaryaddwordbad
worddictionary
worddictionarysearchbad
nullnullnullnullfalsetruetruetrue
maxdoubles
utensil
cost2
pencil
pens
cost1
pen
pencils
decoding
meals
deliciousness
deliciousnessi
meal
suffixes
102001
121000
fixed-length
2021
reversed2
retained
12300
reversed1
1202
boomerang
compress
a2bc3
aabccc
compression
c3
1e5
preceded
insertfront
getfront
mycirculardeque
mycirculardequeint
getrear
insertlast
deletelast
deletefront
4616
gcds
2510
121241510
bbcbaa
bs
aacabb
aecdb
nestedlist
iteratornext
nestediterator
pseudocode
nestediteratorlistnestedinteger
iteratorhasnext
hamstersi
hamster
hamsters
mysterious
func
funcarr
winston
0144567
4567014
less-than-or-equal-to
fractions
stationname
getaveragetime
endstation
startstation
checkoutint
underground
checkin
checkout
undergroundsystem
checkinint
chronological
getaveragetimestring
railway
guessesj
says
lazy
banknotes
atm
600
banknotescount
prioritizes
banknote
deposits
handed
withdrawing
200
300
pattern0
pattern1
sub-island
sub-islands
grid2
grid1
shopping
itembrand
buyer
favoritebrand
itemid
joindate
season
achievable
exponent
python
trap
raining
indices0-indexed
confirming
signup
confirmed
requested
confirmations
expired
signups
confirmation
159
numsii
numsinumslength
357
3x3
leetcodeproblems
folderj
sub-folders
sub-folder
folderi
rj
beautifully
maxjump
minjump
productcategory
barcodesi
barcode
barcodes
13024
24130
rungs
rung
k2
k1
colsumj
fulfills
rowsumlength
rowsumi
colsumlength
rowsum
blocksi
recolor
nums10
nums20
nums21
nums1n
nums2n
nums11
rains
lake
rainsi
dry
rainslength
floods
anslength
driver
compile
freed
allocator
allocatorint
functionalities
allocateint
freeint
coffee
enjoy
enjoyyourcoffee
backspacing
editors
reservedseats
reserved
reservedseatsi
38
exceptional
aisle
four-person
tilt
largest-valued
digitsi
matchesi
defeated
loseri
winneri
sized
bij
numsij
maxbik
completion
time-points
specialin
specialij
offer
needsi
grades
divisorsi
pos2v
pos1x
pos2z
pos2x
pos2y
pos1y
pos1z
pos1v
bombs
detonate
felt
detonated
bombsi
mutating
mutate
changenumi
perm1i
perm2i
squareful
perm1
perm2
presented
differencei
wordsij
equal-length
wordsij1
differenceij
numslots
changedate
2019-08-16
newprice
delayedtime
24-hours
arrivaltime
cornered
exclusively
nums4
nums3k
nums4l
toeplitz
dartsi
throwing
dart
threw
darts
dartboard
10-letter-long
nucleotides
studying
molecule
useful
dna
acgaattccg
fifth
10111
111
125
quantityi
0010
00101022
2002
1101234883
0123
002020
semi-repetitive
54944
heshe
monster
chargethe
monsters
defending
weapon
pricing
highest-ranked
removable
sremovablei
removablelength
2d-plane
prevcoursej
months
nextcoursej
relationsj
dacb
abdc
destroy
seeding
zabcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyzabcd
wraparound
fw
dcce
fqueriesi
k-bit
widthjheightj
widthiheighti
interchangeable
width-to-height
reverseinvertsi
011100110110001
inverts
invertx
reversex
0111001
s4
side-view
gravity
inertia
boxs
uaeio
aaaeeeooo
aeiou
es
aaaaaaeiiiioou
aeoiu
-255
763
-55
ns
numsnumsnumsk
numsnumsk
abcba
abcda
baab
330120031032041
queries3
010221
falsetrue
queries1
lyb
queries0
abba
queries4
palidrome
truefalsefalsetruetrue
queries2
edit
edits
6174
61741
6141
6741
sumnums0numsi
runningsumi
trim
kith
trimmed
trimi
processid
processingtime
activitytype
machineid
promise2
promise1
k-distant
digital
declined
transdate
approved
heightsi2
heightsj-1
heightsj
maxheightsi1
minheightsi
2maximumbit
maximumbit
numsindexi
maxci
max3
tripletsj
max2
tripletsi
maxai
maxbi
max5
words2
words1
customernamei
ordersicustomernameitablenumberifooditemi
fooditemi
tablenumberi
header
havent
backsi
frontsi
fronts
backs
1110
aec
numsli
-5
numsli1
numsri
basic
changetime
lap
rix-1
numlaps
laps
tiresi
tire
tires
race
province
isconnectedij
isconnected
provinces
tanks
km
consumed
maintank
additionaltank
suddenly
injection
mileage
attackj
defensej
defensei
attacki
defense
propertiesi
weak
toggling
entrancerow
entrancecol
maze
k-diff
sub-sequence
repetitions
pictorial
thereafter
omit
one-to-one
endtime2
event2
24
event1
starttime2
endtime1
starttime1
sporting
clip
clips
clipsi
lasted
sumw
075
wlength
pickindex
booleans
most-significant-bit
least-significant-bit
2351
keynamei
alert
one-hour
keytime
keyname
key-cards
saves
doors
0949
keytimei
key-card
keycard
2251
2352
emits
kthlargest
kthlargestint
insertstring
searchstring
dataset
pronounced
autocomplete
trie
startswithstring
rand10
argument
rand7
pangram
vn
v1
en
mult
scope
syntax
lisp-like
v2
scopes
expr
joinwordsi
joinstri
stri
joinab
str0
joinx
strn
words0
poorquerypercentage
queryname
database
winners
compete
against
secondplayer
competes
firstplayer
k-beauty
bababcba
bba
bbabba
pillow
bulky
heavy
columntitle
0124445667
4566701244
colony
prevroomi
prevroom0
prevroom
raised
getkthancestorint
treeancestor
treeancestorint
maxvalue
num1num2
ans1
ans0
prepares
prepare
till
46
maxlen
logn
logm
om
encrypt
encryption
decryption
decryptstring
encrypts
carried
encrypterchar
encrypted
encryptstring
encrypter
painters
painter
paints
hectares
organized
4-length
areas
m-1
four-directionally
hectare
forested
questionsi
brainpoweri
decision
richer
quieti
logically
richeri
quietness
quiety
quiet
answerx
transid
transactedon
addkey
myhashset
containskey
hashset
punishment
accountsi0
accountsi
resend
periodically
channel
originating
channels
patience
resending
replies
patiencei
unordered
adjacency
clone
bottomrightrc
topleftrc
answerrc
shiftt
shiftz
c-1
past
r-1
paragraph
zuma
variation
abac
bcad
wordk
worda
wordb
word3
predecessor
hourglass
datastreamint
consecint
datastream
pairslength
endi-1
trio
trios
birthi
deathi
alive
curs
cur
warmer
redundant
priority
frame
secrets
firstperson
biginteger
auxiliary
ologarrlength
wildcard
ratingj
soldier
ratingk
loaded
ports
deliver
maxweight
storage
portsi
delivered
delivering
maxboxes
portscount
heaviest
movieid
rated
review
createdat
movierating
virus
isinfected
modeled
affected
isinfectedij
threatens
rapidly
quarantine
circulate
roundsi
sector
marathon
rounds0
rounds1
sectors
rec2
rec1
touch
non-star
stars
indirect
remembers
loweri
higheri
belonged
countuniquecharss
countuniquecharst
pseudo-palindromic
102
divisions
summing
finalsum
numsi-1numsj-1
cabxbae
cabxe
cxbae
rows-1
effort
heightsrowcol
hike
hiker
hope
columns-1
manage
reserve
smallest-numbered
seatnumber
reserves
reservation
unreserveint
seatmanager
unreserved
fetches
unreserves
seatmanagerint
subscribed
enables
eventemitter
emitted
callbacks
listeners
subscribing
referentially
nodejs
emit
dom
unsubscribe
subscriptions
emitting
subscribe
debounce
debounced
50ms
35ms
100ms
30ms
95ms
400ms
60ms
150ms
135ms
y22
x22
rankq
answerrowcol
rankp
newinterval
hitsi
stable
erasure
erasures
abe
great
traversals
expire
